/*Задача 1.Напишете функцията void printStr(char *s) аргумент поинтер
към началото на стринга. Използвайте for цикъл и обходете стринга докато
не стигнете знака за на стринг '\0'. На ваяка итерация пристирайте всеки
един елемент на стринга с printf(“%с”, с).*/
#include<stdio.h>
void printStr(char *s){
    for (int c = 0; s[c] != '\0'; c++)
   printf("%c\n", s[c]);
}
int main(){
    char n[]="Hello";
    char s[12]={1,3,4,5,6,7,8,9,0,2,3};
    printStr(n);

}
